# Brewfile — installed by `brew bundle --file=macos/Brewfile`
# Re-running is idempotent: brew skips already-installed entries.
#
# Note: App Store apps (e.g. Magnet) are NOT installed via a third-party CLI.
# bootstrap.sh prompts the user to install them manually from the App Store.

# ── Taps ────────────────────────────────────────────────────────────────────
tap "homebrew/bundle"

# ── CLI tools ───────────────────────────────────────────────────────────────
brew "gh"                # GitHub CLI
brew "git-delta"         # better git diff pager
brew "chezmoi"           # dotfiles manager
brew "1password-cli"     # `op` — used by chezmoi templates for secrets
brew "ripgrep"           # rg — fast grep
brew "fd"                # better find
brew "fzf"               # fuzzy finder
brew "zoxide"            # smart cd
brew "eza"               # modern ls
brew "bat"               # cat with syntax highlighting
brew "jq"                # JSON processor
brew "yq"                # YAML processor
brew "tldr"              # simplified man pages
brew "htop"              # process viewer
brew "neovim"            # editor (default $EDITOR)
brew "imagemagick"       # image manipulation
brew "pnpm"              # JS package manager
brew "bun"               # JS runtime + package manager
# Note: no Node runtime / version manager here on purpose. Node is a
# per-machine concern (work uses nvm) — set it up in ~/.zshrc.local.
brew "gitleaks"          # secret-scanning, used by pre-commit hook

# ── Fonts ───────────────────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"

# ── GUI apps (casks) ────────────────────────────────────────────────────────
cask "ghostty"                # terminal
cask "1password"              # password manager (also pulls 1password-cli auth)
cask "visual-studio-code"     # primary GUI editor
